import telebot

# --------------------------Токены--------------------------
BOT_TOKEN = "5683212966:AAFROD7629pEwgVHLOGyWap0vtKdxN3EdHE"  # Токен бота
bot = telebot.TeleBot(BOT_TOKEN)
need_confirmations = 0
test_send_phone = 0
bot_name = 'Simple BTC'
# --------------------------Токены--------------------------


# --------------------------Ссылки--------------------------
FAQ = "https://telegra.ph/типофао"  # Ссылка на faq
SUPPORT = "https://t.me/Pav_GLash"  # Ссылка на саппорта
CHANNEL = "https://t.me/+M_Pm0yFavUI2MGYy"  # Ссылка на канал
# Польз.соглашение
RULES = "https://telegra.ph/типо соглашение"
# --------------------------Ссылки--------------------------


# ---------------------------Файлы--------------------------
PATH_2_BD = "etc\data\data_base.db"
PATH_2_LOG = "etc\data\log.txt"
PATH_2_SH = "etc/data/sh/sost.bd"
# ---------------------------Файлы--------------------------


# -------------------------Coinbase-------------------------
API_KEY = "12uxumQAif6W8noI"  # Апи ключ от биржи
PRIVATE_KEY = "7XGwXepLMTBqKz5NMx18z6f1gxdbYWBd"
# -------------------------Coinbase-------------------------


# ---------------------------Юзеры--------------------------
ADMINS_ID = [358968367]
# ---------------------------Юзеры--------------------------


# #------------------------Commission------------------------
REMOVAL = 0.0002  # Комиссия на вывод btc
# ------------------------Commission------------------------


# --------------------------Limits--------------------------
ON_REMOVAL = 0.0001  # мин. вывод btc
# --------------------------Limits--------------------------


# ------------------------Об обменах------------------------
min_byu_btc = 1000  # мин. покупка (руб)
min_sell_btc = 1000  # мин. продажа
max_in_btc = 0.0028

commission_on_byu = 15  # на покупку BTC %
commission_on_sell = -15  # на продажу %

REFERAL_INCOME = 5  # реф. %
